AudioTransform(
  (embedding): Embedding(
    (ol1): Sequential(
      (l0): MlpBlock(
        (l1): StdLine(in_features=128, out_features=128, bias=False)
        (nm1): LayerNorm((128,), eps=1e-06, elementwise_affine=True)
        (l2): StdLine(in_features=128, out_features=128, bias=True)
        (nm2): LayerNorm((128,), eps=1e-06, elementwise_affine=True)
        (l3): StdLine(in_features=128, out_features=256, bias=False)
        (nm3): LayerNorm((256,), eps=1e-06, elementwise_affine=True)
        (gelu): GELU(approximate='none')
        (upsample): StdLine(in_features=128, out_features=256, bias=False)
        (us_nm): LayerNorm((256,), eps=1e-06, elementwise_affine=True)
      )
      (l1): MlpBlock(
        (l1): StdLine(in_features=256, out_features=128, bias=False)
        (nm1): LayerNorm((128,), eps=1e-06, elementwise_affine=True)
        (l2): StdLine(in_features=128, out_features=128, bias=False)
        (nm2): LayerNorm((128,), eps=1e-06, elementwise_affine=True)
        (l3): StdLine(in_features=128, out_features=256, bias=False)
        (nm3): LayerNorm((256,), eps=1e-06, elementwise_affine=True)
        (gelu): GELU(approximate='none')
      )
      (l2): MlpBlock(
        (l1): StdLine(in_features=256, out_features=128, bias=False)
        (nm1): LayerNorm((128,), eps=1e-06, elementwise_affine=True)
        (l2): StdLine(in_features=128, out_features=128, bias=False)
        (nm2): LayerNorm((128,), eps=1e-06, elementwise_affine=True)
        (l3): StdLine(in_features=128, out_features=256, bias=False)
        (nm3): LayerNorm((256,), eps=1e-06, elementwise_affine=True)
        (gelu): GELU(approximate='none')
      )
    )
    (ol2): Sequential(
      (l0): MlpBlock(
        (l1): StdLine(in_features=256, out_features=256, bias=False)
        (nm1): LayerNorm((256,), eps=1e-06, elementwise_affine=True)
        (l2): StdLine(in_features=256, out_features=256, bias=True)
        (nm2): LayerNorm((256,), eps=1e-06, elementwise_affine=True)
        (l3): StdLine(in_features=256, out_features=512, bias=False)
        (nm3): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
        (gelu): GELU(approximate='none')
        (upsample): StdLine(in_features=256, out_features=512, bias=False)
        (us_nm): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
      )
      (l1): MlpBlock(
        (l1): StdLine(in_features=512, out_features=256, bias=False)
        (nm1): LayerNorm((256,), eps=1e-06, elementwise_affine=True)
        (l2): StdLine(in_features=256, out_features=256, bias=False)
        (nm2): LayerNorm((256,), eps=1e-06, elementwise_affine=True)
        (l3): StdLine(in_features=256, out_features=512, bias=False)
        (nm3): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
        (gelu): GELU(approximate='none')
      )
      (l2): MlpBlock(
        (l1): StdLine(in_features=512, out_features=256, bias=False)
        (nm1): LayerNorm((256,), eps=1e-06, elementwise_affine=True)
        (l2): StdLine(in_features=256, out_features=256, bias=False)
        (nm2): LayerNorm((256,), eps=1e-06, elementwise_affine=True)
        (l3): StdLine(in_features=256, out_features=512, bias=False)
        (nm3): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
        (gelu): GELU(approximate='none')
      )
      (l3): MlpBlock(
        (l1): StdLine(in_features=512, out_features=256, bias=False)
        (nm1): LayerNorm((256,), eps=1e-06, elementwise_affine=True)
        (l2): StdLine(in_features=256, out_features=256, bias=False)
        (nm2): LayerNorm((256,), eps=1e-06, elementwise_affine=True)
        (l3): StdLine(in_features=256, out_features=512, bias=False)
        (nm3): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
        (gelu): GELU(approximate='none')
      )
      (l4): MlpBlock(
        (l1): StdLine(in_features=512, out_features=256, bias=False)
        (nm1): LayerNorm((256,), eps=1e-06, elementwise_affine=True)
        (l2): StdLine(in_features=256, out_features=256, bias=False)
        (nm2): LayerNorm((256,), eps=1e-06, elementwise_affine=True)
        (l3): StdLine(in_features=256, out_features=512, bias=False)
        (nm3): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
        (gelu): GELU(approximate='none')
      )
      (l5): MlpBlock(
        (l1): StdLine(in_features=512, out_features=256, bias=False)
        (nm1): LayerNorm((256,), eps=1e-06, elementwise_affine=True)
        (l2): StdLine(in_features=256, out_features=256, bias=False)
        (nm2): LayerNorm((256,), eps=1e-06, elementwise_affine=True)
        (l3): StdLine(in_features=256, out_features=512, bias=False)
        (nm3): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
        (gelu): GELU(approximate='none')
      )
    )
    (ol3): Sequential(
      (l0): MlpBlock(
        (l1): StdLine(in_features=512, out_features=512, bias=False)
        (nm1): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
        (l2): StdLine(in_features=512, out_features=512, bias=True)
        (nm2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
        (l3): StdLine(in_features=512, out_features=1024, bias=False)
        (nm3): LayerNorm((1024,), eps=1e-06, elementwise_affine=True)
        (gelu): GELU(approximate='none')
        (upsample): StdLine(in_features=512, out_features=1024, bias=False)
        (us_nm): LayerNorm((1024,), eps=1e-06, elementwise_affine=True)
      )
      (l1): MlpBlock(
        (l1): StdLine(in_features=1024, out_features=512, bias=False)
        (nm1): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
        (l2): StdLine(in_features=512, out_features=512, bias=False)
        (nm2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
        (l3): StdLine(in_features=512, out_features=1024, bias=False)
        (nm3): LayerNorm((1024,), eps=1e-06, elementwise_affine=True)
        (gelu): GELU(approximate='none')
      )
      (l2): MlpBlock(
        (l1): StdLine(in_features=1024, out_features=512, bias=False)
        (nm1): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
        (l2): StdLine(in_features=512, out_features=512, bias=False)
        (nm2): LayerNorm((512,), eps=1e-06, elementwise_affine=True)
        (l3): StdLine(in_features=512, out_features=1024, bias=False)
        (nm3): LayerNorm((1024,), eps=1e-06, elementwise_affine=True)
        (gelu): GELU(approximate='none')
      )
    )
    (drop_out): Dropout(p=0.1, inplace=False)
  )
  (tf_norm): LayerNorm((1024,), eps=1e-06, elementwise_affine=True)
  (layers): ModuleList(
    (0-23): 24 x AttentionBlock(
      (attention_norm): LayerNorm((1024,), eps=1e-06, elementwise_affine=True)
      (attention): MultiHeadAttention(
        (q): Linear(in_features=1024, out_features=1024, bias=True)
        (k): Linear(in_features=1024, out_features=1024, bias=True)
        (v): Linear(in_features=1024, out_features=1024, bias=True)
        (atten_drop): Dropout(p=0.0, inplace=False)
        (o): Linear(in_features=1024, out_features=1024, bias=True)
      )
      (ffn): MultilayerPerceptron(
        (fc1): Linear(in_features=1024, out_features=1024, bias=True)
        (fc2): Linear(in_features=1024, out_features=1024, bias=True)
        (act_fn): GELU(approximate='none')
        (drop_out): Dropout(p=0.1, inplace=False)
      )
      (ffn_norm): LayerNorm((1024,), eps=1e-06, elementwise_affine=True)
    )
  )
)