AudioClassifier(
  (fc1): Linear(in_features=1024, out_features=512, bias=True)
  (avgpool): AdaptiveAvgPool1d(output_size=1)
  (fc2): Linear(in_features=512, out_features=256, bias=True)
  (bn): BatchNorm1d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (fc3): ParametrizedLinear(
    in_features=256, out_features=30, bias=True
    (parametrizations): ModuleDict(
      (weight): ParametrizationList(
        (0): _WeightNorm()
      )
    )
  )
)